[
  {
    "name": "Sarasvathi Suppiah",
    "link": "https://www.google.com/maps/contrib/105404806564594486003/reviews",
    "stars": 5,
    "date": "December 2020",
    "review": "Very professional. Mr June explained every aspect in detail. Product is pricy but it fits the quality. It is worth saving up and investing in this product especially if you are located in a busy area. The product provides security and safety alongside its sound proofing.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Vivien N",
    "link": "https://www.google.com/maps/contrib/106506494461151688778/reviews",
    "stars": 5,
    "date": "August 2020",
    "review": "Just got my windows installed today, excellent services and job execution. The installation team arrived on time and completed the job ahead of schedule. The team cleaned up the affected area right after the job is completed. Found a small defect after the installation had left, the Sales Manager arranged his team back immediately to fix it. Thanks Peter & his team.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Lynn Lim",
    "link": "https://www.google.com/maps/contrib/105274028383730161399/reviews",
    "stars": 5,
    "date": "February 2020",
    "review": "Good services from sales to installations. Highly recommended",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Arnaiz Dass",
    "link": "https://www.google.com/maps/contrib/101659015512555507332/reviews",
    "stars": 5,
    "date": "November 2019",
    "review": "Very professional and prompt. The installers are very skilled and friendly. Overall a very good bunch to get your windows and doors sorted. Sales rep Jeddy was very accommodating and efficient and am looking forward to getting more work done with them.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Marijana D",
    "link": "https://www.google.com/maps/contrib/110540096753518599972/reviews/",
    "stars": 5,
    "date": "November 2019",
    "review": "I have exchanged all my bedroom windows (entire wall of windows : ) overlooking highway in a high rise for Q -windows. I thought that with double glazing I could minimize outside noise. I am very happy with the result, I do think a room is a bit quieter but also my windows look great, they are tight and well adjusted  and the process was as seamless as possible. I had great contact with Q-windows, all was done in time and as arranged, they were very reliable and quick with their replies and dealing with them was very simple and problem free. It is something I greatly appreciated.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Feizal Fakurrudin",
    "link": "https://www.google.com/maps/contrib/105436227073425714256/reviews",
    "stars": 5,
    "date": "October 2019",
    "review": "Probably the best windows/sliding door solution in Malaysia. The product itself is of excellent quality and over engineered. The initial installation process was also seamless. The best is the after sales service, the boss/owner (Andre) actually come up to your property and check the windows himself! I was lucky with my purchase. They tighten what needs to be tightened and review the sliding doors in all aspects. I am very happy with my purchase. You really get what you pay for. I would recommend Q windows without hesitation.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Steven Wong",
    "link": "https://www.google.com/maps/contrib/111494967022682774135/reviews",
    "stars": 5,
    "date": "August 2019",
    "review": "Probably the best soundproofing window and door you can get in Malaysia. Living next to the busy federal highway, road noise pollution is absolutely a concern to me. After replacement from Q-Windows, the sound reduction is phenomenal. It is so quiet that I can hear echos in my room. From measuring to manufacturing to installation, they work very efficiently and professionally. I would definitely recommend Q-Windows. German quality in Malaysia's price. Kudos to the salesman Jeddy, he is very friendly and deep in product knowledge.<br>P.S. By no means is the product cheap (it's not rediculously expensive either) against other local company's offering, but the price is justified as the product is far more advanced and better in quality. If you're concerned about heat penetration, do consider Low-E windows, which is rarer in Malaysia, but does more efficiently reduce heat coming in from outside, good for sides facing the sun (West & East).",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Hiroshi Kitamura",
    "link": "https://www.google.com/maps/contrib/116502557965058695648/reviews?hl=en-DE&sa=X&ved=2ahUKEwi19bDg5KnlAhWMKlAKHajRCb0QvvQBegQIARAs",
    "stars": 5,
    "date": "August 2019",
    "review": "Although we were living in noisy Tokyo and used to be familiar with noise from vehicles and trains, after we moved in we realised Malaysia is much noisier! Also windows are cheap made and do not shut noise from outside. During our house renovation we chose German Windows for replacing bedroom windows and sliding door at living facing next house.<br>The workmanship was extremely high than I expected. I used be a mechanical engineer in Japan and from my eyes they have very good skills. No comparison with the workers for other part of renovation.<br>After replacing bedroom windows, we have overslept several times due to the quietness. We are very much satisfied with the quality and performance of the windows and doors.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Zulhairi Zulkifli",
    "link": "https://www.google.com/maps/contrib/112079384041631218044/reviews",
    "stars": 5,
    "date": "September 2019",
    "review": "Qwindows is really helpful and professional. They provide the best & only tilt and turn windows, tilt and slide door system in Malaysia as well as really good soundproof system. Good service and professional advice from them!<br>Special thanks to Andre!",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Jai Khan",
    "link": "https://www.google.com/maps/contrib/112874034771456292852/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "Getting a Q-Window for my bedroom in my apartment was one of the best purchases I've ever made for myself. The reduction in sound is very apparent and my sleep has really improved. Plus it makes the old bedroom look so much prettier. Thanks Q-Windows. I never could have guessed a good window can really improve your life so much.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "MSB Associates",
    "link": "https://www.google.com/maps/contrib/103857431841373897749/reviews",
    "stars": 4,
    "date": "July 2019",
    "review": "It’s a good product providing us the satisfaction  with ambience looks, solidity and secured features not forgetting sound reduction to certain extent. Quite happy with the installation. Had the privilege of personal ground attention from the firm’s owner himself. It’s a learning curve for the staff and team to improve installation techniques.<br>One star of the 5 stars rating is reserved for further improvement. Well done Q-Windows!!!",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Rivs D",
    "link": "https://www.google.com/maps/contrib/108573493882103126676/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "High product quality, great soundproof system. Provide good before and after sales services. The installation team was really professional. Very happy with their team and service, from ordering, site visit to installation and payment, everything was efficient. Highly recommended, will come back again for further renovation!",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Zairodah Sagaf",
    "link": "https://www.google.com/maps/contrib/115104630996167818193/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "I’m very satisfied as the product is very high quality and the service is very good, from sales up to installation. Very responsive to queries. Michelle, the sales person is very helpful and she has very deep knowledge on the products. Her explanation is clear. Highly recommended to those who are looking for security windows with beautiful design. Thanks again Michelle and Q Windows.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Jessica Chan",
    "link": "https://www.google.com/maps/contrib/110067795904987599306/reviews",
    "stars": 5,
    "date": "August 2019",
    "review": "The window is the greatest investment! We've been having sleep problem due to the busy road right in front of our house, after installing the window the noise reduced tremendously and we have much better sleep quality now. Thumbs up!",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Azhar Ibrahim",
    "link": "https://www.google.com/maps/contrib/101809743050352839555/reviews",
    "stars": 5,
    "date": "August 2019",
    "review": "The product is of high quality with a wide range of glass panels combination that you can customise to suit your needs. The aluminium frames are strong and sturdy with so many colours available. Most important of all is the friendly service and also the excellent after sales service.even for outstation customers like me. The product is reasonably priced and I've made the right choice by engaging German Windows for my renovation project.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "love foodie",
    "link": "https://www.google.com/maps/contrib/110779809944259159952/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "Top notch quality windows, modern looking and best of all, its security features and sound proofing. Greatest service too, before or after sales. The marketer and boss were very attentive and polite.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Yeowkheng Lim",
    "link": "https://www.google.com/maps/contrib/102595154316534833959/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "We found Q-Window when we did the renovation at the Reach @Titiwangsa Condominium. Q-Window was able to deliver the quality as claimed with the specifications specified. We are happy with the work done. I would recommend that to anyone who has the interest to install their condominium or house, so that your unit not only looks more up market property but it is the noice reduction that gives you the comfort and money worth. Thank you Q-Window.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Sathiamurthi .R",
    "link": "https://www.google.com/maps/contrib/115502924966088100533/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "Andre and his team at Q windows deliver on their promise. There is simply no on in the market who can match their price, quality and workmanship! Trust us we have been to all of them.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Eloi Marigó Ferrer",
    "link": "https://www.google.com/maps/contrib/104338919004832345929/reviews",
    "stars": 5,
    "date": "August 2019",
    "review": "We have installed soundproof window in our bedroom to isolate from the traffic noise and we are very pleased with the overall improvement. Our sleep quality has improved and the thermal isolation is a bonus.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "issac liew",
    "link": "https://www.google.com/maps/contrib/111351145894087313064/reviews",
    "stars": 5,
    "date": "July 2019",
    "review": "Very good response team, professional staffs, quality products. Noise cut out around 50% more than usual windows, heat cut out almost 80%. Overall satisfied.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "nico turn",
    "link": "https://www.google.com/maps/contrib/106901890681847974011/reviews",
    "stars": 5,
    "date": "June 2019",
    "review": "Thanks to Jeddy and his team for their great work, pro team from start to finish. Pricy but quality is def there thanks to german tech.",
    "source": "Google",
    "id": ""
  },
  {
    "name": "Delia W.",
    "link": "",
    "stars": 5,
    "date": "2018",
    "review": "Dealing with German Windows was very professional. Fantastic product, looks great, security brilliant, fantastic after installation service.",
    "source": "Facebook",
    "picture": "/assets/images/landing/headshot_delia.jpg",
    "id": ""
  },
  {
    "name": "Jörg S.",
    "link": "",
    "stars": 5,
    "date": "2018",
    "review": "Sound proof as promised, competent service and timely delivery. The communication with German Windows and the service was excellent. Definitely a recommendation.",
    "source": "Facebook",
    "picture": "/assets/images/landing/headshot_joerg.jpg",
    "id": ""
  },
  {
    "name": "Kian L.",
    "link": "",
    "stars": 5,
    "date": "2018",
    "review": "Perfect workmanship with premium quality product!! Bought double glazed window, very satisfy with it!",
    "source": "Facebook",
    "picture": "/assets/images/landing/headshot_kian.jpg",
    "id": ""
  },
  {
    "name": "Maarten V.",
    "link": "",
    "stars": 5,
    "date": "2018",
    "review": "If you're looking for quality windows and door this is the place to go. The service is personal and professional and the windows make a real difference to our lives (less noise and less heat).",
    "source": "Facebook",
    "picture": "/assets/images/landing/headshot_maarten.jpg",
    "id": ""
  }
]
